export const mockProgram = {
  CCTV1: [
    {
      "start": "00:13",
      "desc": "",
      "end": "00:50",
      "title": "寻古中国-稻谷记2"
    },
    {
      "start": "00:50",
      "desc": "",
      "end": "01:12",
      "title": "人口-2024-16"
    },
    {
      "start": "01:12",
      "desc": "",
      "end": "01:40",
      "title": "今日说法-2024-98"
    },
    {
      "start": "01:40",
      "desc": "",
      "end": "02:09",
      "title": "人与自然-2024-104"
    },
    {
      "start": "02:09",
      "desc": "",
      "end": "02:39",
      "title": "晚间新闻"
    },
    {
      "start": "02:39",
      "desc": "",
      "end": "02:50",
      "title": "非遗里的中国-秀演精编1"
    },
    {
      "start": "02:50",
      "desc": "",
      "end": "03:00",
      "title": "非遗里的中国-秀演精编6"
    },
    {
      "start": "03:00",
      "desc": "",
      "end": "03:08",
      "title": "精彩一刻-2024-172国宝三兰亭序"
    },
    {
      "start": "03:08",
      "desc": "",
      "end": "04:25",
      "title": "星光大道-2024-17"
    },
    {
      "start": "04:25",
      "desc": "",
      "end": "04:56",
      "title": "今日说法-2024-98"
    },
    {
      "start": "04:56",
      "desc": "",
      "end": "05:30",
      "title": "新闻联播"
    },
    {
      "start": "05:30",
      "desc": "",
      "end": "06:00",
      "title": "人与自然-2024-8"
    },
    {
      "start": "06:00",
      "desc": "",
      "end": "08:30",
      "title": "朝闻天下"
    },
    {
      "start": "08:30",
      "desc": "",
      "end": "08:40",
      "title": "朝闻天下"
    },
    {
      "start": "08:40",
      "desc": "",
      "end": "10:20",
      "title": "新闻直播间"
    },
    {
      "start": "10:20",
      "desc": "",
      "end": "10:40",
      "title": "新闻直播间"
    },
    {
      "start": "10:40",
      "desc": "",
      "end": "11:59",
      "title": "新闻直播间"
    },
    {
      "start": "11:59",
      "desc": "",
      "end": "12:00",
      "title": "新闻直播间"
    },
    {
      "start": "12:00",
      "desc": "",
      "end": "12:35",
      "title": "新闻30分"
    },
    {
      "start": "12:35",
      "desc": "",
      "end": "13:10",
      "title": "今日说法-2024-99"
    },
    {
      "start": "13:10",
      "desc": "",
      "end": "13:56",
      "title": "我们的队伍向太阳第16集"
    },
    {
      "start": "13:56",
      "desc": "",
      "end": "14:47",
      "title": "我们的队伍向太阳第17集"
    },
    {
      "start": "14:47",
      "desc": "",
      "end": "15:34",
      "title": "我们的队伍向太阳第18集"
    },
    {
      "start": "15:34",
      "desc": "",
      "end": "16:21",
      "title": "我们的队伍向太阳第19集"
    },
    {
      "start": "16:21",
      "desc": "",
      "end": "17:08",
      "title": "我们的队伍向太阳第20集"
    },
    {
      "start": "17:08",
      "desc": "",
      "end": "17:37",
      "title": "第一动画乐园-2024-188"
    },
    {
      "start": "17:37",
      "desc": "",
      "end": "17:46",
      "title": "第一动画乐园-2024-189"
    },
    {
      "start": "17:46",
      "desc": "",
      "end": "18:18",
      "title": "第一动画乐园-2024-190"
    },
    {
      "start": "18:18",
      "desc": "",
      "end": "18:50",
      "title": "瞬间中国-端牢中国饭碗-9"
    },
    {
      "start": "18:50",
      "desc": "",
      "end": "19:00",
      "title": "2024秘境之眼-103"
    },
    {
      "start": "19:00",
      "desc": "",
      "end": "19:38",
      "title": "新闻联播"
    },
    {
      "start": "19:38",
      "desc": "",
      "end": "20:01",
      "title": "焦点访谈"
    },
    {
      "start": "20:01",
      "desc": "",
      "end": "20:06",
      "title": "前情提要- 《城中之城》第23集"
    },
    {
      "start": "20:06",
      "desc": "",
      "end": "20:55",
      "title": "城中之城-（一套版）-第23集"
    },
    {
      "start": "20:55",
      "desc": "",
      "end": "20:59",
      "title": "前情提要- 《城中之城》第24集"
    },
    {
      "start": "20:59",
      "desc": "",
      "end": "21:48",
      "title": "城中之城-（一套版）-第24集"
    },
    {
      "start": "21:48",
      "desc": "",
      "end": "22:00",
      "title": "精彩一刻-2024-182国宝三铜龙"
    },
    {
      "start": "22:00",
      "desc": "",
      "end": "22:35",
      "title": "晚间新闻"
    },
    {
      "start": "22:35",
      "desc": "",
      "end": "23:59",
      "title": "简牍探中华-1"
    }
  ],
  CCTV2: [
    {
      "start": "00:36",
      "desc": "",
      "end": "01:36",
      "title": "欢乐大猜想-2024-16"
    },
    {
      "start": "01:36",
      "desc": "",
      "end": "02:36",
      "title": "澳门双行线-12"
    },
    {
      "start": "02:36",
      "desc": "",
      "end": "03:21",
      "title": "大国建造(第二季)-重播-1"
    },
    {
      "start": "03:21",
      "desc": "",
      "end": "03:34",
      "title": "周末特供2023-中国传统建筑的智慧1-13分版"
    },
    {
      "start": "03:34",
      "desc": "",
      "end": "04:32",
      "title": "职场健康课-2024-15"
    },
    {
      "start": "04:32",
      "desc": "",
      "end": "05:00",
      "title": "回家吃饭-2024-94"
    },
    {
      "start": "05:00",
      "desc": "",
      "end": "05:31",
      "title": "消费主张"
    },
    {
      "start": "05:31",
      "desc": "",
      "end": "05:59",
      "title": "生财有道-2024-4-23"
    },
    {
      "start": "05:59",
      "desc": "",
      "end": "07:00",
      "title": "经济信息联播"
    },
    {
      "start": "07:00",
      "desc": "",
      "end": "09:00",
      "title": "第一时间"
    },
    {
      "start": "09:00",
      "desc": "",
      "end": "10:00",
      "title": "正点财经"
    },
    {
      "start": "10:00",
      "desc": "",
      "end": "10:30",
      "title": "正点财经"
    },
    {
      "start": "10:30",
      "desc": "",
      "end": "11:00",
      "title": "经济半小时"
    },
    {
      "start": "11:00",
      "desc": "",
      "end": "11:30",
      "title": "正点财经"
    },
    {
      "start": "11:30",
      "desc": "",
      "end": "11:44",
      "title": "周末特供2024-245"
    },
    {
      "start": "11:44",
      "desc": "",
      "end": "12:00",
      "title": "周末特供2024-246"
    },
    {
      "start": "12:00",
      "desc": "",
      "end": "13:00",
      "title": "天下财经"
    },
    {
      "start": "13:00",
      "desc": "",
      "end": "13:31",
      "title": "周末特供2024-栋梁之材6"
    },
    {
      "start": "13:31",
      "desc": "",
      "end": "14:00",
      "title": "回家吃饭-2024-94"
    },
    {
      "start": "14:00",
      "desc": "",
      "end": "14:30",
      "title": "正点财经"
    },
    {
      "start": "14:30",
      "desc": "",
      "end": "15:00",
      "title": "消费主张"
    },
    {
      "start": "15:00",
      "desc": "",
      "end": "15:30",
      "title": "正点财经"
    },
    {
      "start": "15:30",
      "desc": "",
      "end": "16:00",
      "title": "生财有道-2024-4-23"
    },
    {
      "start": "16:00",
      "desc": "",
      "end": "17:00",
      "title": "正点财经"
    },
    {
      "start": "17:00",
      "desc": "",
      "end": "17:32",
      "title": "正点财经"
    },
    {
      "start": "17:32",
      "desc": "",
      "end": "17:45",
      "title": "周末特供2023-乡野有真味7-13分版"
    },
    {
      "start": "17:45",
      "desc": "",
      "end": "18:07",
      "title": "2021精品财经纪录-千年陕菜-3"
    },
    {
      "start": "18:07",
      "desc": "",
      "end": "18:30",
      "title": "2021精品财经纪录-千年陕菜-4"
    },
    {
      "start": "18:30",
      "desc": "",
      "end": "19:00",
      "title": "回家吃饭-2024-95"
    },
    {
      "start": "19:00",
      "desc": "",
      "end": "19:30",
      "title": "生财有道-2024-4-24"
    },
    {
      "start": "19:30",
      "desc": "",
      "end": "20:00",
      "title": "消费主张"
    },
    {
      "start": "20:00",
      "desc": "",
      "end": "20:30",
      "title": "经济半小时"
    },
    {
      "start": "20:30",
      "desc": "",
      "end": "21:30",
      "title": "经济信息联播"
    },
    {
      "start": "21:30",
      "desc": "",
      "end": "21:55",
      "title": "央视财经评论-2024-4-24"
    },
    {
      "start": "21:55",
      "desc": "",
      "end": "21:58",
      "title": "中国福利彩票公益开奖-2024-87"
    },
    {
      "start": "21:58",
      "desc": "",
      "end": "22:33",
      "title": "2024精品财经纪录-万物之生贵州篇-3"
    },
    {
      "start": "22:33",
      "desc": "",
      "end": "23:36",
      "title": "职场健康课-2024-15"
    },
    {
      "start": "23:36",
      "desc": "",
      "end": "23:59",
      "title": "经济半小时"
    }
  ],
  CCTV3: [
    {
      "start": "00:05",
      "desc": "",
      "end": "00:52",
      "title": "综艺喜乐汇-2024-376 一路朝阳12/36"
    },
    {
      "start": "00:52",
      "desc": "",
      "end": "02:06",
      "title": "综艺喜乐汇-2024-13"
    },
    {
      "start": "02:06",
      "desc": "",
      "end": "03:04",
      "title": "综艺喜乐汇-2024-194乐龄唱响-8"
    },
    {
      "start": "03:04",
      "desc": "",
      "end": "04:36",
      "title": "经典咏流传-正青春-16"
    },
    {
      "start": "04:36",
      "desc": "",
      "end": "04:41",
      "title": "2024年春节联欢晚会-年锦（4K）"
    },
    {
      "start": "04:41",
      "desc": "",
      "end": "04:53",
      "title": "综艺喜乐汇-2023-953"
    },
    {
      "start": "04:53",
      "desc": "",
      "end": "06:16",
      "title": "拿手好戏-10重播版"
    },
    {
      "start": "06:16",
      "desc": "",
      "end": "07:12",
      "title": "综艺喜乐汇-2024-348 国家宝藏系列专题节目 7"
    },
    {
      "start": "07:12",
      "desc": "",
      "end": "07:29",
      "title": "文化十分-2024-90"
    },
    {
      "start": "07:29",
      "desc": "",
      "end": "08:49",
      "title": "综艺喜乐汇-2024-4"
    },
    {
      "start": "08:49",
      "desc": "",
      "end": "09:47",
      "title": "我爱满堂彩-2024-13满堂喝彩"
    },
    {
      "start": "09:47",
      "desc": "",
      "end": "11:11",
      "title": "向幸福出发-2024-17"
    },
    {
      "start": "11:11",
      "desc": "",
      "end": "11:29",
      "title": "文化十分-2024-91"
    },
    {
      "start": "11:29",
      "desc": "",
      "end": "12:54",
      "title": "越战越勇-2024-15"
    },
    {
      "start": "12:54",
      "desc": "",
      "end": "14:14",
      "title": "非常6+1-2024-4"
    },
    {
      "start": "14:14",
      "desc": "",
      "end": "15:47",
      "title": "乐在旅途-3"
    },
    {
      "start": "15:47",
      "desc": "",
      "end": "16:46",
      "title": "幸福账单-2024-2"
    },
    {
      "start": "16:46",
      "desc": "",
      "end": "18:04",
      "title": "我爱满堂彩-2024-11满堂喝彩"
    },
    {
      "start": "18:04",
      "desc": "",
      "end": "19:30",
      "title": "开门大吉-2024-17"
    },
    {
      "start": "19:30",
      "desc": "",
      "end": "20:52",
      "title": "越战越勇-2024-16"
    },
    {
      "start": "20:52",
      "desc": "",
      "end": "21:48",
      "title": "我爱满堂彩-2024-14满堂喝彩"
    },
    {
      "start": "21:48",
      "desc": "",
      "end": "23:02",
      "title": "非常6+1-2024-1"
    },
    {
      "start": "23:02",
      "desc": "",
      "end": "23:50",
      "title": "综艺喜乐汇-2024-377 一路朝阳13/36"
    },
    {
      "start": "23:50",
      "desc": "",
      "end": "23:59",
      "title": "综艺喜乐汇-2024-378 一路朝阳14/36"
    }
  ]
}